espressif/esp-idf/components/soc/esp32/register/soc/ledc_reg.h
#define LEDC_HSCH2_CONF1_REG          (DR_REG_LEDC_BASE + 0x0034)
/* LEDC_DUTY_START_HSCH2 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: When reg_duty_num_hsch2 reg_duty_cycle_hsch2 and reg_duty_scale_hsch2
 has been configured. these register won't take effect until set reg_duty_start_hsch2. this bit is automatically cleared by hardware.*/
#define LEDC_DUTY_START_HSCH2  (BIT(31))
#define LEDC_DUTY_START_HSCH2_M  (BIT(31))
#define LEDC_DUTY_START_HSCH2_V  0x1
#define LEDC_DUTY_START_HSCH2_S  31
/* LEDC_DUTY_INC_HSCH2 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This register is used to increase the duty of output signal or
 decrease the duty of output signal for high speed channel2.*/
#define LEDC_DUTY_INC_HSCH2  (BIT(30))
#define LEDC_DUTY_INC_HSCH2_M  (BIT(30))
#define LEDC_DUTY_INC_HSCH2_V  0x1
#define LEDC_DUTY_INC_HSCH2_S  30
/* LEDC_DUTY_NUM_HSCH2 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: This register is used to control the num of increased or decreased
 times for high speed channel2.*/
#define LEDC_DUTY_NUM_HSCH2  0x000003FF
#define LEDC_DUTY_NUM_HSCH2_M  ((LEDC_DUTY_NUM_HSCH2_V)<<(LEDC_DUTY_NUM_HSCH2_S))
#define LEDC_DUTY_NUM_HSCH2_V  0x3FF
#define LEDC_DUTY_NUM_HSCH2_S  20
/* LEDC_DUTY_CYCLE_HSCH2 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: This register is used to increase or decrease the duty every
 reg_duty_cycle_hsch2 cycles for high speed channel2.*/
#define LEDC_DUTY_CYCLE_HSCH2  0x000003FF
#define LEDC_DUTY_CYCLE_HSCH2_M  ((LEDC_DUTY_CYCLE_HSCH2_V)<<(LEDC_DUTY_CYCLE_HSCH2_S))
#define LEDC_DUTY_CYCLE_HSCH2_V  0x3FF
#define LEDC_DUTY_CYCLE_HSCH2_S  10
/* LEDC_DUTY_SCALE_HSCH2 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: This register controls the increase or decrease step scale for
 high speed channel2.*/
#define LEDC_DUTY_SCALE_HSCH2  0x000003FF
#define LEDC_DUTY_SCALE_HSCH2_M  ((LEDC_DUTY_SCALE_HSCH2_V)<<(LEDC_DUTY_SCALE_HSCH2_S))
#define LEDC_DUTY_SCALE_HSCH2_V  0x3FF
#define LEDC_DUTY_SCALE_HSCH2_S  0

#define LEDC_HSCH2_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x0038)
/* LEDC_DUTY_HSCH2 : RO ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: This register represents the current duty of the output signal
 for high speed channel2.*/
#define LEDC_DUTY_HSCH2  0x01FFFFFF
#define LEDC_DUTY_HSCH2_M  ((LEDC_DUTY_HSCH2_V)<<(LEDC_DUTY_HSCH2_S))
#define LEDC_DUTY_HSCH2_V  0x1FFFFFF
#define LEDC_DUTY_HSCH2_S  0

#define LEDC_HSCH3_CONF0_REG          (DR_REG_LEDC_BASE + 0x003C)
/* LEDC_IDLE_LV_HSCH3 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This bit is used to control the output value when high speed channel3 is off.*/
#define LEDC_IDLE_LV_HSCH3  (BIT(3))
#define LEDC_IDLE_LV_HSCH3_M  (BIT(3))
#define LEDC_IDLE_LV_HSCH3_V  0x1
#define LEDC_IDLE_LV_HSCH3_S  3
/* LEDC_SIG_OUT_EN_HSCH3 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the output enable control bit for high speed channel3*/
#define LEDC_SIG_OUT_EN_HSCH3  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH3_M  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH3_V  0x1
#define LEDC_SIG_OUT_EN_HSCH3_S  2
/* LEDC_TIMER_SEL_HSCH3 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: There are four high speed timers  the two bits are used to select
 one of them for high speed channel3.  2'b00: seletc hstimer0.   2'b01: select hstimer1.  2'b10: select hstimer2.    2'b11: select hstimer3.*/
#define LEDC_TIMER_SEL_HSCH3  0x00000003
#define LEDC_TIMER_SEL_HSCH3_M  ((LEDC_TIMER_SEL_HSCH3_V)<<(LEDC_TIMER_SEL_HSCH3_S))
#define LEDC_TIMER_SEL_HSCH3_V  0x3
#define LEDC_TIMER_SEL_HSCH3_S  0

#define LEDC_HSCH3_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0040)
/* LEDC_HPOINT_HSCH3 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when htimerx(x=[0 3]) selected
 by high speed channel3 has reached reg_hpoint_hsch3[19:0]*/
#define LEDC_HPOINT_HSCH3  0x000FFFFF
#define LEDC_HPOINT_HSCH3_M  ((LEDC_HPOINT_HSCH3_V)<<(LEDC_HPOINT_HSCH3_S))
#define LEDC_HPOINT_HSCH3_V  0xFFFFF
#define LEDC_HPOINT_HSCH3_S  0

#define LEDC_HSCH3_DUTY_REG          (DR_REG_LEDC_BASE + 0x0044)
/* LEDC_DUTY_HSCH3 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When hstimerx(x=[0
 3]) chosen by high speed channel3 has reached reg_lpoint_hsch3 the output signal changes to low. reg_lpoint_hsch3=(reg_hpoint_hsch3[19:0]+reg_duty_hsch3[24:4])          (1)  reg_lpoint_hsch3=(reg_hpoint_hsch3[19:0]+reg_duty_hsch3[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_HSCH3  0x01FFFFFF
#define LEDC_DUTY_HSCH3_M  ((LEDC_DUTY_HSCH3_V)<<(LEDC_DUTY_HSCH3_S))
#define LEDC_DUTY_HSCH3_V  0x1FFFFFF
#define LEDC_DUTY_HSCH3_S  0

#define LEDC_HSCH3_CONF1_REG          (DR_REG_LEDC_BASE + 0x0048)
/* LEDC_DUTY_START_HSCH3 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: When reg_duty_num_hsch3 reg_duty_cycle_hsch3 and reg_duty_scale_hsch3
 has been configured. these register won't take effect until set reg_duty_start_hsch3. this bit is automatically cleared by hardware.*/
#define LEDC_DUTY_START_HSCH3  (BIT(31))
#define LEDC_DUTY_START_HSCH3_M  (BIT(31))
#define LEDC_DUTY_START_HSCH3_V  0x1
#define LEDC_DUTY_START_HSCH3_S  31
/* LEDC_DUTY_INC_HSCH3 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This register is used to increase the duty of output signal or
 decrease the duty of output signal for high speed channel3.*/
#define LEDC_DUTY_INC_HSCH3  (BIT(30))
#define LEDC_DUTY_INC_HSCH3_M  (BIT(30))
#define LEDC_DUTY_INC_HSCH3_V  0x1
#define LEDC_DUTY_INC_HSCH3_S  30
/* LEDC_DUTY_NUM_HSCH3 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: This register is used to control the num of increased or decreased
 times for high speed channel3.*/
#define LEDC_DUTY_NUM_HSCH3  0x000003FF
#define LEDC_DUTY_NUM_HSCH3_M  ((LEDC_DUTY_NUM_HSCH3_V)<<(LEDC_DUTY_NUM_HSCH3_S))
#define LEDC_DUTY_NUM_HSCH3_V  0x3FF
#define LEDC_DUTY_NUM_HSCH3_S  20
/* LEDC_DUTY_CYCLE_HSCH3 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: This register is used to increase or decrease the duty every
 reg_duty_cycle_hsch3 cycles for high speed channel3.*/
#define LEDC_DUTY_CYCLE_HSCH3  0x000003FF
#define LEDC_DUTY_CYCLE_HSCH3_M  ((LEDC_DUTY_CYCLE_HSCH3_V)<<(LEDC_DUTY_CYCLE_HSCH3_S))
#define LEDC_DUTY_CYCLE_HSCH3_V  0x3FF
#define LEDC_DUTY_CYCLE_HSCH3_S  10
/* LEDC_DUTY_SCALE_HSCH3 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: This register controls the increase or decrease step scale for
 high speed channel3.*/
#define LEDC_DUTY_SCALE_HSCH3  0x000003FF
#define LEDC_DUTY_SCALE_HSCH3_M  ((LEDC_DUTY_SCALE_HSCH3_V)<<(LEDC_DUTY_SCALE_HSCH3_S))
#define LEDC_DUTY_SCALE_HSCH3_V  0x3FF
#define LEDC_DUTY_SCALE_HSCH3_S  0

#define LEDC_HSCH3_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x004C)
/* LEDC_DUTY_HSCH3 : RO ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: This register represents the current duty of the output signal
 for high speed channel3.*/
#define LEDC_DUTY_HSCH3  0x01FFFFFF
#define LEDC_DUTY_HSCH3_M  ((LEDC_DUTY_HSCH3_V)<<(LEDC_DUTY_HSCH3_S))
#define LEDC_DUTY_HSCH3_V  0x1FFFFFF
#define LEDC_DUTY_HSCH3_S  0

