espressif/esp-idf/components/soc/esp32/register/soc/ledc_reg.h
#define LEDC_HSCH4_CONF0_REG          (DR_REG_LEDC_BASE + 0x0050)
/* LEDC_IDLE_LV_HSCH4 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This bit is used to control the output value when high speed channel4 is off.*/
#define LEDC_IDLE_LV_HSCH4  (BIT(3))
#define LEDC_IDLE_LV_HSCH4_M  (BIT(3))
#define LEDC_IDLE_LV_HSCH4_V  0x1
#define LEDC_IDLE_LV_HSCH4_S  3
/* LEDC_SIG_OUT_EN_HSCH4 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the output enable control bit for high speed channel4*/
#define LEDC_SIG_OUT_EN_HSCH4  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH4_M  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH4_V  0x1
#define LEDC_SIG_OUT_EN_HSCH4_S  2
/* LEDC_TIMER_SEL_HSCH4 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: There are four high speed timers  the two bits are used to select
 one of them for high speed channel4.  2'b00: seletc hstimer0.   2'b01: select hstimer1.  2'b10: select hstimer2.    2'b11: select hstimer3.*/
#define LEDC_TIMER_SEL_HSCH4  0x00000003
#define LEDC_TIMER_SEL_HSCH4_M  ((LEDC_TIMER_SEL_HSCH4_V)<<(LEDC_TIMER_SEL_HSCH4_S))
#define LEDC_TIMER_SEL_HSCH4_V  0x3
#define LEDC_TIMER_SEL_HSCH4_S  0

#define LEDC_HSCH4_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0054)
/* LEDC_HPOINT_HSCH4 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when htimerx(x=[0 3]) selected
 by high speed channel4 has reached reg_hpoint_hsch4[19:0]*/
#define LEDC_HPOINT_HSCH4  0x000FFFFF
#define LEDC_HPOINT_HSCH4_M  ((LEDC_HPOINT_HSCH4_V)<<(LEDC_HPOINT_HSCH4_S))
#define LEDC_HPOINT_HSCH4_V  0xFFFFF
#define LEDC_HPOINT_HSCH4_S  0

#define LEDC_HSCH4_DUTY_REG          (DR_REG_LEDC_BASE + 0x0058)
/* LEDC_DUTY_HSCH4 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When hstimerx(x=[0
 3]) chosen by high speed channel4 has reached reg_lpoint_hsch4 the output signal changes to low. reg_lpoint_hsch4=(reg_hpoint_hsch4[19:0]+reg_duty_hsch4[24:4])          (1)  reg_lpoint_hsch4=(reg_hpoint_hsch4[19:0]+reg_duty_hsch4[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_HSCH4  0x01FFFFFF
#define LEDC_DUTY_HSCH4_M  ((LEDC_DUTY_HSCH4_V)<<(LEDC_DUTY_HSCH4_S))
#define LEDC_DUTY_HSCH4_V  0x1FFFFFF
#define LEDC_DUTY_HSCH4_S  0

#define LEDC_HSCH4_CONF1_REG          (DR_REG_LEDC_BASE + 0x005C)
/* LEDC_DUTY_START_HSCH4 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: When reg_duty_num_hsch1 reg_duty_cycle_hsch1 and reg_duty_scale_hsch1
 has been configured. these register won't take effect until set reg_duty_start_hsch1. this bit is automatically cleared by hardware.*/
#define LEDC_DUTY_START_HSCH4  (BIT(31))
#define LEDC_DUTY_START_HSCH4_M  (BIT(31))
#define LEDC_DUTY_START_HSCH4_V  0x1
#define LEDC_DUTY_START_HSCH4_S  31
/* LEDC_DUTY_INC_HSCH4 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This register is used to increase the duty of output signal or
 decrease the duty of output signal for high speed channel4.*/
#define LEDC_DUTY_INC_HSCH4  (BIT(30))
#define LEDC_DUTY_INC_HSCH4_M  (BIT(30))
#define LEDC_DUTY_INC_HSCH4_V  0x1
#define LEDC_DUTY_INC_HSCH4_S  30
/* LEDC_DUTY_NUM_HSCH4 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: This register is used to control the num of increased or decreased
 times for high speed channel1.*/
#define LEDC_DUTY_NUM_HSCH4  0x000003FF
#define LEDC_DUTY_NUM_HSCH4_M  ((LEDC_DUTY_NUM_HSCH4_V)<<(LEDC_DUTY_NUM_HSCH4_S))
#define LEDC_DUTY_NUM_HSCH4_V  0x3FF
#define LEDC_DUTY_NUM_HSCH4_S  20
/* LEDC_DUTY_CYCLE_HSCH4 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: This register is used to increase or decrease the duty every
 reg_duty_cycle_hsch4 cycles for high speed channel4.*/
#define LEDC_DUTY_CYCLE_HSCH4  0x000003FF
#define LEDC_DUTY_CYCLE_HSCH4_M  ((LEDC_DUTY_CYCLE_HSCH4_V)<<(LEDC_DUTY_CYCLE_HSCH4_S))
#define LEDC_DUTY_CYCLE_HSCH4_V  0x3FF
#define LEDC_DUTY_CYCLE_HSCH4_S  10
/* LEDC_DUTY_SCALE_HSCH4 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: This register controls the increase or decrease step scale for
 high speed channel4.*/
#define LEDC_DUTY_SCALE_HSCH4  0x000003FF
#define LEDC_DUTY_SCALE_HSCH4_M  ((LEDC_DUTY_SCALE_HSCH4_V)<<(LEDC_DUTY_SCALE_HSCH4_S))
#define LEDC_DUTY_SCALE_HSCH4_V  0x3FF
#define LEDC_DUTY_SCALE_HSCH4_S  0

#define LEDC_HSCH4_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x0060)
/* LEDC_DUTY_HSCH4 : RO ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: This register represents the current duty of the output signal
 for high speed channel4.*/
#define LEDC_DUTY_HSCH4  0x01FFFFFF
#define LEDC_DUTY_HSCH4_M  ((LEDC_DUTY_HSCH4_V)<<(LEDC_DUTY_HSCH4_S))
#define LEDC_DUTY_HSCH4_V  0x1FFFFFF
#define LEDC_DUTY_HSCH4_S  0

#define LEDC_HSCH5_CONF0_REG          (DR_REG_LEDC_BASE + 0x0064)
/* LEDC_IDLE_LV_HSCH5 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This bit is used to control the output value when high speed channel5 is off.*/
#define LEDC_IDLE_LV_HSCH5  (BIT(3))
#define LEDC_IDLE_LV_HSCH5_M  (BIT(3))
#define LEDC_IDLE_LV_HSCH5_V  0x1
#define LEDC_IDLE_LV_HSCH5_S  3
/* LEDC_SIG_OUT_EN_HSCH5 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the output enable control bit for high speed channel5.*/
#define LEDC_SIG_OUT_EN_HSCH5  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH5_M  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH5_V  0x1
#define LEDC_SIG_OUT_EN_HSCH5_S  2
/* LEDC_TIMER_SEL_HSCH5 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: There are four high speed timers  the two bits are used to select
 one of them for high speed channel5.  2'b00: seletc hstimer0.   2'b01: select hstimer1.  2'b10: select hstimer2.    2'b11: select hstimer3.*/
#define LEDC_TIMER_SEL_HSCH5  0x00000003
#define LEDC_TIMER_SEL_HSCH5_M  ((LEDC_TIMER_SEL_HSCH5_V)<<(LEDC_TIMER_SEL_HSCH5_S))
#define LEDC_TIMER_SEL_HSCH5_V  0x3
#define LEDC_TIMER_SEL_HSCH5_S  0

#define LEDC_HSCH5_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0068)
/* LEDC_HPOINT_HSCH5 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when htimerx(x=[0 3]) selected
 by high speed channel5 has reached reg_hpoint_hsch5[19:0]*/
#define LEDC_HPOINT_HSCH5  0x000FFFFF
#define LEDC_HPOINT_HSCH5_M  ((LEDC_HPOINT_HSCH5_V)<<(LEDC_HPOINT_HSCH5_S))
#define LEDC_HPOINT_HSCH5_V  0xFFFFF
#define LEDC_HPOINT_HSCH5_S  0

#define LEDC_HSCH5_DUTY_REG          (DR_REG_LEDC_BASE + 0x006C)
/* LEDC_DUTY_HSCH5 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When hstimerx(x=[0
 3]) chosen by high speed channel5 has reached reg_lpoint_hsch5 the output signal changes to low. reg_lpoint_hsch5=(reg_hpoint_hsch5[19:0]+reg_duty_hsch5[24:4])          (1)  reg_lpoint_hsch5=(reg_hpoint_hsch5[19:0]+reg_duty_hsch5[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_HSCH5  0x01FFFFFF
#define LEDC_DUTY_HSCH5_M  ((LEDC_DUTY_HSCH5_V)<<(LEDC_DUTY_HSCH5_S))
#define LEDC_DUTY_HSCH5_V  0x1FFFFFF
#define LEDC_DUTY_HSCH5_S  0

